Repository: lhmouse/nano-win
Catalog: po/*.po
Languages: no

source: add_to_cutbuffer called with inptr->data = %s
no: add_to_cutbuffer vart kalla med inptr->data = %s

source: Blew away cutbuffer =)
no: Frigjorde cut-bufferet

source: read_line: not on first line and prev is NULL
no: read_line: ikkje på første linje, og prev er NULL

source: Read %d lines
no: Leste %d linjer

source: "%s" not found
no: "%s" ikke funnet

source: New File
no: Ny fil

source: File "%s" is a directory
no: Fila er en katalog

source: File "%s" is a device file
no: Fila er ikke ei vanlig fil

source: Reading File
no: Leser fil

source: File to insert [from ./]
no: Fil som skal settast inn [frå ./]

source: filename is %s
no: filnavnet er %s

source: Cancelled
no: Avbrutt

source: Could not open file for writing: %s
no: Kunne ikkje åpne fila for skriving: %s

source: Wrote >%s
no: Skreiv >%s

source: Could not close %s: %s
no: Kunne ikke lukke %s: %s

source: Could not open %s for writing: %s
no: Kunne ikke åpne %s for skriving: %s

source: Could not set permissions %o on %s: %s
no: Kunne ikke sette rettighetebe %o på %s: %s

source: Wrote %d lines
no: Skreiv %d linjer

source: File exists, OVERWRITE ?
no: Fila eksisterar, OVERSKRIVE ?

source: (more)
no: (meir)

source: Can't move up a directory
no: Kan ikke skifte katalog

source: Can't open "%s": %s
no: Kan ikke åpne "%s": %s

source: Goto Directory
no: Gå til katalog

source: Goto Cancelled
no: Gåtil avbrutt

source: Constant cursor position
no: Konstant kursorposisjon

source: Auto indent
no: Automatisk indentering

source: Suspend
no: Legg i bakgrunnen

source: Help mode
no: Hjelp-instilling

source: Pico mode
no: Pico-instilling

source: Mouse support
no: Musestøtte

source: Cut to end
no: Klipp til slutten

source: Regular expressions
no: Regulært uttrykk

source: Auto wrap
no: Automatisk linjeskift

source: Invoke the help menu
no: Vis hjelp-menyen

source: Write the current file to disk
no: Lagre gjeldande fil

source: Exit from nano
no: Avslutt nano

source: Goto a specific line number
no: Hopp til eit linjenummer

source: Justify the current paragraph
no: Juster avsnittet

source: Unjustify after a justify
no: Fjern justering etter ei justering

source: Replace text within the editor
no: Erstatt tekst

source: Insert another file into the current one
no: Sett inn ei anna fil i denne

source: Search for text within the editor
no: Søk etter tekst

source: Move to the previous screen
no: Gå til forrige skjerm

source: Move to the next screen
no: Gå til neste skjerm

source: Cut the current line and store it in the cutbuffer
no: Klipp denne linja og lagre den i klippebufferet

source: Uncut from the cutbuffer into the current line
no: Sett inn klippebufferet her

source: Show the position of the cursor
no: Vis kursorposisjonen

source: Invoke the spell checker (if available)
no: Start stavesjekk (viss tilgjengelig)

source: Move up one line
no: Flytt opp ei linje

source: Move down one line
no: Flytt ned ei linje

source: Move forward one character
no: Flytt fram ein bokstav

source: Move back one character
no: Flytt tilbake ein bokstav

source: Move to the beginning of the current line
no: Flytt til starten av linja

source: Move to the end of the current line
no: Flytt til enden av linja

source: Go to the first line of the file
no: Gå til første linje

source: Go to the last line of the file
no: Gå til siste linje

source: Refresh (redraw) the current screen
no: Tegn skjermen på nytt

source: Mark text at the current cursor location
no: Marker teksten ved kursor

source: Delete the character under the cursor
no: Slett bokstaven under kursor

source: Delete the character to the left of the cursor
no: Slett bokstaven til venstre for kursor

source: Insert a tab character
no: Sett inn et tab-tegn

source: Insert a carriage return at the cursor position
no: Sett inn et linjeskift

source: Make the current search or replace case (in)sensitive
no: Gjer gjeldande søk utan hensyn til store/små bokstavar

source: Go to file browser
no: Gå til fil-lesar

source: Cancel the current function
no: Avbryt gjeldande funksjon

source: Append to the current file
no: Legg til noverande fil

source: Get Help
no: Hjelp

source: Exit
no: Avslutt

source: WriteOut
no: Lagre

source: Justify
no: Juster

source: Read File
no: Les fil

source: Replace
no: Erstatt

source: Where Is
no: Finn

source: Prev Page
no: Forrige side

source: Next Page
no: Neste side

source: Cut Text
no: Klipp

source: UnJustify
no: Avjuster

source: UnCut Txt
no: Lim inn

source: Cur Pos
no: Posisjon

source: To Spell
no: Staving

source: Up
no: Opp

source: Down
no: Ned

source: Forward
no: Framover

source: Back
no: Bakover

source: Home
no: Hjem

source: End
no: Bunn

source: Refresh
no: Oppfrisk

source: Mark Text
no: Marker tekst

source: Delete
no: Slett

source: Backspace
no: Visketast

source: Goto Line
no: Gå til linje

source: Cancel
no: Avbryt

source: First Line
no: Første linje

source: Last Line
no: Siste linje

source: Case Sens
no: Følsomt for store/små bokstavar

source: Regexp
no: Regulært uttrykk

source: No Replace
no: Ingen erstatting

source: To Files
no: Til filer

source: Append
no: Legg til

source: Goto
no: Gå til

source: Buffer written to %s
no: Buffer lagra til %s

source: No %s written (file exists?)
no: %s ikkje lagra (fila eksisterar?)

source: Window size is too small for Nano...
no: Vinduet er for lite for Nano...

source: Key illegal in VIEW mode
no: Taten er ulovlig i LES-modus

source: nano help text The nano editor is designed to emulate the functionality and ease-of-use of the UW Pico text editor. There are four main sections of the editor: The top line shows the program version, the current filename being edited, and whether or not the file has been modified. Next is the main editor window showing the file being edited. The status line is the third line from the bottom and shows important messages. The bottom two lines show the most commonly used shortcuts in the editor. The notation for shortcuts is as follows: Control-key sequences are notated with a caret (^) symbol and are entered with the Control (Ctrl) key. Escape-key sequences are notated with the Meta (M) symbol and can be entered using either the Esc, Alt or Meta key depending on your keyboard setup. The following keystrokes are available in the main editor window. Optional keys are shown in parentheses:
no: Nano hjelpetekst Nano tekstredigeringsprogram er designa for å etterligne funksjonaliteten og bruksmåten for universitetet i Washington sitt Pico-program. Der er fire hovedområde i dette programmet: Den øverste linja viser versjonsnummeret og navnet på fila som vert redigert. Nedanfor er hovedvinduet som viser fila som vert endra. Status-linja er den 3. linja nedanfrå og viser viktige meldinger. Dei to nederste linjene viser dei vanlegaste snarvegane i programmet. Snarvegane er beskreve slik: Control-tast sekvensar er skreve med eit karet (^) symbol, og blir skreve med Control (Ctrl) tasten. Escape-tast sekvensar er skreve med meta (M) symbolet og kan skrivast enten med Esc, Alt eller Meta-tasten avhengig av tastaturoppsettet ditt. Dei følgande tastetrykka er tilgjengelige i hovedvinduet. Valgfrie tastar er vist i parentes:

source: delete_node(): free'd a node, YAY!
no: delete_node(): frigjorde en node, HURRA !

source: delete_node(): free'd last node.
no: delete_node(): frigjorde siste node.

source: Usage: nano [GNU long option] [option] +LINE <file>
no: Bruk: nano [GNU lange opsjonar] [opsjonar] +LINJE <fil>

source: Option Long option Meaning
no: Opsjon Lang opsjon Mening

source: -R --regexp Use regular expressions for search
no: -R --regexp Bruk regulære uttrykk

source: -T [num] --tabsize=[num] Set width of a tab to num
no: -T [num] --tabsize=[num] Set størrelsen på tab til num

source: -V --version Print version information and exit
no: -V --version Skriv ut versjonsnummer og avslutt

source: -c --const Constantly show cursor position
no: -c --const Vis kursorposisjon

source: -h --help Show this message
no: -h --help Vis denne meldinga

source: -i --autoindent Automatically indent new lines
no: -i --autonindent Indenter nye linjer automatisk

source: -k --cut Let ^K cut from cursor to end of line
no: -k --cut La ^K klippe fra kursoren

source: -l --nofollow Don't follow symbolic links, overwrite
no: -l --nofollow Ikke følg symbolske lenker, overskriv

source: -m --mouse Enable mouse
no: -m --mouse Skru på musstøttet

source: -r [#cols] --fill=[#cols] Set fill cols to (wrap lines at) #cols
no: -r [#cols] --fill=[#cols] Bryt linjer på posisjon #cols

source: -s [prog] --speller=[prog] Enable alternate speller
no: -s [prog] --speller=[prog] Bruk prog for stavesjekk

source: -t --tempfile Auto save on exit, don't prompt
no: -t --tempfile Autolagre ved avslutting

source: -v --view View (read only) mode
no: -v --view Vis (bare lesing) modus

source: -w --nowrap Don't wrap long lines
no: -w --nowrap Ikkje bryt lange linjer

source: -x --nohelp Don't show help window
no: -x --nohelp Ikkje vis hjelpevindu

source: -z --suspend Enable suspend
no: -z --suspend Skru på suspend

source: +LINE Start at line number LINE
no: +LINJE Start på linje LINJE

source: Usage: nano [option] +LINE <file>
no: Bruk: nano [opsjon] +LINJE <fil>

source: Option Meaning
no: Opsjon Betydning

source: -R Use regular expressions for search
no: -R Bruk regulære uttrykk for søking

source: -T [num] Set width of a tab to num
no: -T [num] Set bredda på en tab til num

source: -V Print version information and exit
no: -V Skriv versjonsnummeret og avslutt

source: -c Constantly show cursor position
no: -c Vis kursorposisjonen konstant

source: -h Show this message
no: -h Vis denne meldinga

source: -i Automatically indent new lines
no: -i Indenter nye linjer automagisk

source: -k Let ^K cut from cursor to end of line
no: -k La ^K kutte frå kursoren

source: -l Don't follow symbolic links, overwrite
no: -l Ikkje følg symbolske linkar, overskriv

source: -m Enable mouse
no: -m Skru på støtte for mus

source: -p Emulate Pico as closely as possible
no: -p Etterlign Pico så nøyaktig som mulig

source: -r [#cols] Set fill cols to (wrap lines at) #cols
no: -r [#cols] Bryt linjer ved posisjon #cols

source: -s [prog] Enable alternate speller
no: -s [prog] Bruk prog til stavesjekking

source: -t Auto save on exit, don't prompt
no: -t Autolagre ved avslutning

source: -v View (read only) mode
no: -v Vis (bare les) modus

source: -w Don't wrap long lines
no: -w Ikke bryt lange linjer

source: -x Don't show help window
no: -x Ikkje vis hjelpevindu

source: -z Enable suspend
no: -z Tillat suspend

source: +LINE Start at line number LINE
no: +LINJE Start på linje nummer LINJE

source: GNU nano version %s (compiled %s, %s)
no: GNU nano versjon %s (kompilert %s, %s)

source: Email: nano@nano-editor.org Web: http://www.nano-editor.org
no: Epost: nano@nano-editor.org Www: http://www.nano-editor.org

source: Compiled options:
no: Kompilerte opsjoner:

source: Mark Set
no: Merke satt

source: Mark UNset
no: Merke fjerna

source: check_wrap called with inptr->data="%s"
no: check_wrap kalla med inptr->data="%s"

source: current->data now = "%s"
no: current->data nå = "%s"

source: After, data = "%s"
no: Etter, data = "%s"

source: Edit a replacement
no: Rediger erstatning

source: Could not create a temporary filename: %s
no: Kunne ikkje oprette midlertidig fil: %s

source: Spell checking failed: unable to write temp file!
no: Stavekontroll feila: kunne ikkje lage midlertidig fil!

source: Finished checking spelling
no: Stavekontroll fullført

source: Spell checking failed
no: Stavekontroll feila

source: Save modified buffer (ANSWERING "No" WILL DESTROY CHANGES) ?
no: Lagre endra buffer ("No" VIL MISTE ENDRINGENE) ?

source: Received SIGHUP
no: Mottok SIGHUP

source: Cannot resize top win
no: Kan ikke endre størrelse på toppvinduet

source: Cannot move top win
no: Kan ikke flytte toppvinduet

source: Cannot resize edit win
no: Kan ikke endre størrelse på redigeringsvinduet

source: Cannot move edit win
no: Kan iikke flytte redigeringsvinduet

source: Cannot resize bottom win
no: Kan ikke endre størrelse på bunnvinduet

source: Cannot move bottom win
no: Kan ikke flytte bunnvinduet

source: Can now UnJustify!
no: Du kan no avjustere!

source: %s enable/disable
no: %s skru på/av

source: enabled
no: på

source: disabled
no: av

source: NumLock glitch detected. Keypad will malfunction with NumLock off
no: NumLock-feil oppdaga. Nummer-tastane vil fungere feil med NumLock av

source: Main: set up windows
no: Hoved: Vinduer satt opp

source: Main: bottom win
no: Hoved: bunnvindu

source: Main: open file
no: Hoved: åpne fil

source: I got Alt-O-%c! (%d)
no: Jeg fikk Alt-O-%c! (%d)

source: I got Alt-[-1-%c! (%d)
no: Jeg fikk Alt-[-1-%c! (%d)

source: I got Alt-[-2-%c! (%d)
no: Jeg fikk Alt-[-2-%c! (%d)

source: I got Alt-[-%c! (%d)
no: Jeg fikk Alt-[-%c! (%d)

source: I got Alt-%c! (%d)
no: Jeg fikk Alt-%c (%d)

source: Press return to continue starting nano
no: Trykk retur for å fortsette lastingen av nano

source: parse_rcfile: Read a comment
no: parse_rcfile: Leste en kommentar

source: Error in %s on line %d: command %s not understood
no: Feil i %s på linje %d: kommandon %s ikke forståelig

source: parse_rcfile: Parsing option %s
no: parse_rcfile: Leser inn opsjon %s

source: Error in %s on line %d: option %s requires an argument
no: Feil i %s på linje %d: opsjonen %s krever et argument

source: Error in %s on line %d: requested fill size %d too small
no: Feil i %s på linje %d: den foreslåtte fyllbredda er %d for lav

source: set flag %d!
no: sett flagget %d!

source: unset flag %d!
no: Skru av flagget %d!

source: Errors found in .nanorc file
no: Feil funnet i .nanorc fila

source: Unable to open ~/.nanorc file, %s
no: Kan ikkje åpne ~/.nanorc, %s

source: Search
no: Søk

source: (to replace)
no: (å erstatte)

source: Search Cancelled
no: Søk avbrutt

source: "%s..." not found
no: "%s..." ikke funnet

source: Search Wrapped
no: Søket gikk rundt

source: Replaced %d occurrences
no: Erstattet %d tilfeller

source: Replaced 1 occurrence
no: Erstattet 1 tilfelle

source: Replace Cancelled
no: Erstatt avbrutt

source: Replace this instance?
no: Erstatt dette tilfellet?

source: Replace failed: unknown subexpression!
no: Erstatt feila: ukjent underuttrykk!

source: Replace with [%s]
no: Erstatt med [%s]

source: Replace with
no: Erstatt med

source: Enter line number
no: Skriv linjenummer

source: Aborted
no: Avbrutt

source: Come on, be reasonable
no: Kom igjen, samarbeid litt

source: nano: malloc: out of memory!
no: nano: malloc: tom for minne!

source: nano: calloc: out of memory!
no: nano: calloc: tom for minne!

source: nano: realloc: out of memory!
no: nano: realloc: tom for minne!

source: actual_x_from_start for xplus=%d returned %d
no: actual_x_from_start for xplus=%d returnerte %d

source: New Buffer
no: Ny buffer

source: File: ...
no: Fil: ...

source: DIR: ...
no: KAT: ...

source: Modified
no: Endret

source: Moved to (%d, %d) in edit buffer
no: Flyttet til (%d, %d) i rediger buffer

source: I got "%s"
no: Jeg fikk "%s"

source: Yy
no: JjYy

source: Yes
no: Ja

source: All
no: Alle

source: No
no: Nei

source: line %d of %d (%.0f%%), character %ld of %ld (%.0f%%)
no: linje %d av %d (%.0f%%), tegn %ld av %ld (%.0f%%)

source: Dumping file buffer to stderr...
no: Dumper fil-bufferet til stderr...

source: Dumping cutbuffer to stderr...
no: Dumper klippbufferet til stderr...

source: Dumping a buffer to stderr...
no: Skriver et buffer til stderr...

source: The nano text editor
no: Tekstredigererern nano

source: version
no: versjon

source: Brought to you by:
no: Bragt til deg av:

source: Special thanks to:
no: Mange takk til:

source: The Free Software Foundation
no: The Free Sofware Foundation

source: Pavel Curtis, Zeyd Ben-Halim and Eric S. Raymond for ncurses
no: Pavel Curtis, Zeyd Ben-Halim og Eric S. Raymond for ncurses

source: and anyone else we forgot...
no: og alle dei andre vi glømte...

source: Thank you for using nano!
no: Takk for at du bruker nano!
